#ifndef MIK32_HAL_SCR1_TIMER
#define MIK32_HAL_SCR1_TIMER

#include "mcu32_memory_map.h"
#include "power_manager.h"
#include "inttypes.h"
#include "mik32_hal_pcc.h"

#include "csr.h"
#include "scr1_csr_encoding.h"
#include "scr1_timer.h"



/**
 * Р Р°Р·СЂРµС€РёС‚СЊ СЂР°Р±РѕС‚Сѓ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 */
#define __HAL_SCR1_TIMER_ENABLE()   (SCR1_TIMER->TIMER_CTRL |= SCR1_TIMER_CTRL_ENABLE_M)

/**
 * Р—Р°РїСЂРµС‚РёС‚СЊ СЂР°Р±РѕС‚Сѓ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 */
#define __HAL_SCR1_TIMER_DISABLE()  (SCR1_TIMER->TIMER_CTRL &= ~SCR1_TIMER_CTRL_ENABLE_M)

/**
 * Р—Р°РґР°С‚СЊ РґРµР»РёС‚РµР»СЊ С‡Р°СЃС‚РѕС‚С‹ РґР»СЏ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * Р”РµР»РёС‚РµР»СЊ С‡Р°СЃС‚РѕС‚С‹ С‚Р°Р№РјРµСЂР° СЂР°СЃСЃС‡РёС‚С‹РІР°РµС‚СЃСЏ РєР°Рє @p __DIV__ + 1.
 * Р—РЅР°С‡РµРЅРёРµ РїР°СЂР°РјРµС‚СЂР° @p __DIV__ РјРѕР¶РµС‚ Р±С‹С‚СЊ РѕС‚ 0 РґРѕ 1023.
 */
#define __HAL_SCR1_TIMER_SET_DIVIDER(__DIV__)   (SCR1_TIMER->TIMER_DIV = (__DIV__) & 0x3FF)

/**
 * Р—Р°РґР°С‚СЊ Р·РЅР°С‡РµРЅРёРµ СЃС‡РµС‚С‡РёРєР° СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * Р—РЅР°С‡РµРЅРёРµ РїР°СЂР°РјРµС‚СЂР° @p __V__ РјРѕР¶РµС‚ Р±С‹С‚СЊ 64-Р±РёС‚РЅС‹Рј С‡РёСЃР»РѕРј.
 */
#define __HAL_SCR1_TIMER_SET_TIME(__V__)                               \
    ({                                                                 \
        SCR1_TIMER->MTIMEH = 0;                                        \
        SCR1_TIMER->MTIME = (uint32_t)(__V__);                         \
        SCR1_TIMER->MTIMEH = (uint32_t)((uint64_t)(__V__) >> 32);      \
    })

/**
 * РџРѕР»СѓС‡РёС‚СЊ Р·РЅР°С‡РµРЅРёРµ СЃС‡РµС‚С‡РёРєР° СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * Р’РѕР·РІСЂР°С‰Р°РµРјРѕРµ Р·РЅР°С‡РµРЅРёРµ РёРјРµРµС‚ С‚РёРї uint64_t.
 */
#define __HAL_SCR1_TIMER_GET_TIME()   (((uint64_t)(SCR1_TIMER->MTIMEH) << 32) | (SCR1_TIMER->MTIME))

/**
 * Р—Р°РґР°С‚СЊ Р·РЅР°С‡РµРЅРёРµ СЃСЂР°РІРЅРµРЅРёСЏ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * Р—РЅР°С‡РµРЅРёРµ РїР°СЂР°РјРµС‚СЂР° @p __CMP__ РјРѕР¶РµС‚ Р±С‹С‚СЊ 64-Р±РёС‚РЅС‹Рј С‡РёСЃР»РѕРј.
 * РњРѕР¶РµС‚ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊСЃСЏ РґР»СЏ СЃР±СЂРѕСЃР° РїСЂРµСЂС‹РІР°РЅРёСЏ РїРѕ СЃСЂР°РІРЅРµРЅРёСЋ.
 */
#define __HAL_SCR1_TIMER_SET_CMP(__CMP__)                                   \
    ({                                                                      \
        SCR1_TIMER->MTIMECMPH = -1;                                         \
        SCR1_TIMER->MTIMECMP = (uint32_t)(__CMP__);                         \
        SCR1_TIMER->MTIMECMPH = (uint32_t)((uint64_t)(__CMP__) >> 32);      \
    })                                                                          

/**
 * РџРѕР»СѓС‡РёС‚СЊ Р·РЅР°С‡РµРЅРёРµ СЃСЂР°РІРЅРµРЅРёСЏ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * Р’РѕР·РІСЂР°С‰Р°РµРјРѕРµ Р·РЅР°С‡РµРЅРёРµ РёРјРµРµС‚ С‚РёРї uint64_t.
 */
#define __HAL_SCR1_TIMER_GET_CMP()   (((uint64_t)(SCR1_TIMER->MTIMECMPH) << 32) | (SCR1_TIMER->MTIMECMP))

/**
 * Р Р°Р·СЂРµС€РёС‚СЊ РіР»РѕР±Р°Р»СЊРЅС‹Рµ РїСЂРµСЂС‹РІР°РЅРёСЏ Рё РїСЂРµСЂС‹РІР°РЅРёРµ РїРѕ СЃСЂР°РІРЅРµРЅРёСЋ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 */
#define __HAL_SCR1_TIMER_IRQ_ENABLE()       \
    ({                                      \
        set_csr(mstatus, MSTATUS_MIE);      \
        set_csr(mie, MIE_MTIE);             \
    })

/**
 * Р—Р°РїСЂРµС‚РёС‚СЊ РїСЂРµСЂС‹РІР°РЅРёРµ РїРѕ СЃСЂР°РІРЅРµРЅРёСЋ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 */
#define __HAL_SCR1_TIMER_IRQ_DISABLE()  (clear_csr(mie, MIE_MTIE))
    
    

/* РџРµСЂРµС‡РёСЃР»РµРЅРёРµ РёСЃС‚РѕС‡РЅРёРєРѕРІ С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°. */
typedef enum __HAL_SCR1_TIMER_ModeTypeDef
{
    /**
     * @brief РўР°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ СЏРґСЂР°.
     */
    HAL_SCR1_TIMER_CLKSRC_INTERNAL = SCR1_TIMER_CTRL_CLKSRC_INTERNAL_M,
    
    /**
     * @brief РўР°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ РІРЅРµС€РЅРµРіРѕ RTC
     */
    HAL_SCR1_TIMER_CLKSRC_EXTERNAL_RTC = SCR1_TIMER_CTRL_CLKSRC_RTC_M
} HAL_SCR1_TIMER_ModeTypeDef;



/**
 * @brief Р¤СѓРЅРєС†РёСЏ СѓСЃС‚Р°РЅРѕРІРєРё РёСЃС‚РѕС‡РЅРёРєР° С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * @param clockSource Р�СЃС‚РѕС‡РЅРёРє С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 *                  Р­С‚РѕС‚ РїР°СЂР°РјРµС‚СЂ РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ РѕРґРЅРёРј РёР· СЃР»РµРґСѓСЋС‰РёС… Р·РЅР°С‡РµРЅРёР№:
 *                      - @ref HAL_SCR1_TIMER_CLKSRC_INTERNAL - С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ СЏРґСЂР°
 *                      - @ref HAL_SCR1_TIMER_CLKSRC_EXTERNAL_RTC - С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ РІРЅРµС€РЅРµРіРѕ RTC
 */
static inline __attribute__((always_inline)) void HAL_SCR1_Timer_SetClockSource(HAL_SCR1_TIMER_ModeTypeDef clockSource)
{
    switch (clockSource)
    {
    case HAL_SCR1_TIMER_CLKSRC_INTERNAL:
        SCR1_TIMER->TIMER_CTRL &= ~SCR1_TIMER_CTRL_CLKSRC_M;
        break;

    case HAL_SCR1_TIMER_CLKSRC_EXTERNAL_RTC:
        SCR1_TIMER->TIMER_CTRL |= SCR1_TIMER_CTRL_CLKSRC_M;
        break;

    default:
        break;
    }
}


/**
 * @brief Р¤СѓРЅРєС†РёСЏ СЃР±СЂРѕСЃР° СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * 
 * Р’Рѕ РІСЂРµРјСЏ СЃР±СЂРѕСЃР° С‚Р°Р№РјРµСЂ РѕСЃС‚Р°РЅР°РІР»РёРІР°РµС‚СЃСЏ, С‡Р°СЃС‚РѕС‚Р° СЏРґСЂР° РІС‹Р±РёСЂР°РµС‚СЃСЏ РєР°Рє РёСЃС‚РѕС‡РЅРёРє С‡Р°СЃС‚РѕС‚С‹.
 * Р—РЅР°С‡РµРЅРёРµ СЃС‡РµС‚С‡РёРєР° С‚Р°Р№РјРµСЂР° TIME СЃС‚Р°РЅРѕРІРёС‚СЃСЏ 0, Р° Р·РЅР°С‡РµРЅРёРµ СЃСЂР°РІРЅРµРЅРёРµ CMP 0xFFFFFFFFFFFFFFFF.
 */
static inline __attribute__((always_inline)) void HAL_SCR1_Timer_Reset(void)
{
    SCR1_TIMER->TIMER_CTRL = 0;
    SCR1_TIMER->TIMER_DIV = 0;

    SCR1_TIMER->MTIME = 0;
    SCR1_TIMER->MTIMEH = 0;

    SCR1_TIMER->MTIMECMP = -1;
    SCR1_TIMER->MTIMECMPH = -1;
}

#if 0
/**
 * @brief Р¤СѓРЅРєС†РёСЏ РёРЅРёС†РёР°Р»РёР·Р°С†РёРё СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 * @param clockSource РёСЃС‚РѕС‡РЅРёРє С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 *                  Р­С‚РѕС‚ РїР°СЂР°РјРµС‚СЂ РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ РѕРґРЅРёРј РёР· СЃР»РµРґСѓСЋС‰РёС… Р·РЅР°С‡РµРЅРёР№:
 *                      - @ref HAL_SCR1_TIMER_CLKSRC_INTERNAL - С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ СЏРґСЂР°
 *                      - @ref HAL_SCR1_TIMER_CLKSRC_EXTERNAL_RTC - С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ РІРЅРµС€РЅРµРіРѕ RTC
 * @param divider РґРµР»РёС‚РµР»СЊ С‡Р°СЃС‚РѕС‚С‹ СЃРёСЃС‚РµРјРЅРѕРіРѕ С‚Р°Р№РјРµСЂР°.
 *                  Р”РµР»РёС‚РµР»СЊ С‡Р°СЃС‚РѕС‚С‹ С‚Р°Р№РјРµСЂР° СЂР°СЃСЃС‡РёС‚С‹РІР°РµС‚СЃСЏ РєР°Рє @p divider + 1.
 *                  Р—РЅР°С‡РµРЅРёРµ РїР°СЂР°РјРµС‚СЂР° @p divider РјРѕР¶РµС‚ Р±С‹С‚СЊ РѕС‚ 0 РґРѕ 1023.
 */
static inline __attribute__((always_inline))
void HAL_SCR1_Timer_Init(HAL_SCR1_TIMER_ModeTypeDef clockSource, uint32_t divider)
{
    __HAL_SCR1_TIMER_DISABLE();
    HAL_SCR1_Timer_SetClockSource(clockSource);
    __HAL_SCR1_TIMER_SET_DIVIDER(divider);

    __HAL_SCR1_TIMER_SET_TIME(0);
    __HAL_SCR1_TIMER_SET_CMP(-1);
    __HAL_SCR1_TIMER_ENABLE();
}
#endif


void HAL_Time_SCR1TIM_Init(void);
uint32_t HAL_Time_SCR1TIM_Micros(void);
uint32_t HAL_Time_SCR1TIM_Millis(void);
void HAL_Time_SCR1TIM_DelayUs(uint32_t time_us);
void HAL_Time_SCR1TIM_DelayMs(uint32_t time_ms);


#endif // MIK32_HAL_SCR1_TIMER



/*
 * uint32_t TIMER_CTRL;
 * uint32_t TIMER_DIV;
 * uint32_t MTIME;
 * uint32_t MTIMEH;    
 * uint32_t MTIMECMP;
 * uint32_t MTIMECMPH;
 */

/*
Р РµРіРёСЃС‚СЂ TIMER_CTRL
------------------------------------------------------------------------------------------------
РћР±РѕР·РЅР°С‡РµРЅРёРµ     |   Р‘РёС‚С‹    |   РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ    |   РћРїРёСЃР°РЅРёРµ                |   Р”РѕСЃС‚СѓРї
------------------------------------------------------------------------------------------------
ENABLE          |   0       |   1               |   Р’РєР»СЋС‡РµРЅРёРµ С‚Р°Р№РјРµСЂР°       |   RW
------------------------------------------------------------------------------------------------
CLKSRC          |   1       |   0               |   Р�СЃС‚РѕС‡РЅРёРє С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ   |   RW
                |           |                   |   0 - РўР°РєС‚РёСЂРѕРІР°РЅРёСЏ СЏРґСЂР°   |
                |           |                   |   1 - Р’РЅРµС€РЅРёР№ RTC         |
------------------------------------------------------------------------------------------------
Reserved        |   31:2    |                                               |   RZ
------------------------------------------------------------------------------------------------


Р РµРіРёСЃС‚СЂ TIMER_DIV
------------------------------------------------------------------------------------------------
РћР±РѕР·РЅР°С‡РµРЅРёРµ     |   Р‘РёС‚С‹    |   РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ    |   РћРїРёСЃР°РЅРёРµ                |   Р”РѕСЃС‚СѓРї
------------------------------------------------------------------------------------------------
DIV             |   9:0     |   0               |   Р”РµР»РёС‚РµР»СЊ                |   RW
                                                |   РЎС‡РµС‚ РёРґРµС‚ РєР°Р¶РґС‹Рµ DIV+1  |
                                                |   С‚Р°РєС‚Р° С‡Р°СЃС‚РѕС‚С‹           |
------------------------------------------------------------------------------------------------
Reserved        |   31:10   |   X                                           |   RZ
------------------------------------------------------------------------------------------------


РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ, MTIME Рё MTIMEH СЂР°РІРЅС‹ РЅСѓР»СЋ РїРѕСЃР»Рµ РїРµСЂРµР·Р°РіСЂСѓР·РєРё СЏРґСЂР° (РєРѕС‚РѕСЂР°СЏ С‚Р°РєР¶Рµ
РЅР°С‡РёРЅР°РµС‚ РїРѕРґСЃС‡РµС‚). Р”СЂСѓРіРёРј РІР°СЂРёР°РЅС‚РѕРј РЅР°С‡Р°Р»Р° СЃС‡РµС‚Р° РґР»СЏ MTIME/MTIMEH СЏРІР»СЏРµС‚СЃСЏ Р·Р°РїРёСЃСЊ РЅРµРєРѕС‚РѕСЂРѕРіРѕ Р·РЅР°С‡РµРЅРёСЏ РІ
MTIME/MTIMEH.

MTIME - РЎС‡РµС‚С‡РёРє С‚Р°Р№РјРµСЂР°. 64-Р±РёС‚РЅРµ С‡РёСЃР»Рѕ. MTIMEH - СЃС‚Р°СЂС€РµРµ СЃР»РѕРІРѕ, MTIME - РјР»Р°РґС€РµРµ СЃР»РѕРІРѕ.
MTIMECMP - Р РµРіРёСЃС‚СЂ СЃСЂР°РІРЅРµРЅРёСЏ. 64-Р±РёС‚РЅРѕРµ С‡РёСЃР»Рѕ. MTIMECMPH - СЃС‚Р°СЂС€РµРµ СЃР»РѕРІРѕ, MTIMECMP - РјР»Р°РґС€РµРµ СЃР»РѕРІРѕ.

РџСЂРµСЂС‹РІР°РЅРёРµ РјР°С€РёРЅРЅРѕРіРѕ С‚Р°Р№РјРµСЂР° СЃСЂР°Р±Р°С‚С‹РІР°РµС‚, РєРѕРіРґР° mtime СЃРѕРґРµСЂР¶РёС‚ Р·РЅР°С‡РµРЅРёРµ, Р±РѕР»СЊС€РµРµ РёР»Рё СЂР°РІРЅРѕРµ mtimecmp,
РѕР±СЂР°Р±Р°С‚С‹РІР°СЏ Р·РЅР°С‡РµРЅРёСЏ РєР°Рє С†РµР»С‹Рµ С‡РёСЃР»Р° Р±РµР· Р·РЅР°РєР°. РџСЂРµСЂС‹РІР°РЅРёРµ РѕСЃС‚Р°РµС‚СЃСЏ РІ СЃРѕСЃС‚РѕСЏРЅРёРё РѕР¶РёРґР°РЅРёСЏ РґРѕ С‚РµС… РїРѕСЂ, РїРѕРєР° mtimecmp РЅРµ СЃС‚Р°РЅРµС‚ Р±РѕР»СЊС€Рµ
mtime (РѕР±С‹С‡РЅРѕ РІ СЂРµР·СѓР»СЊС‚Р°С‚Рµ Р·Р°РїРёСЃРё mtimecmp). РџСЂРµСЂС‹РІР°РЅРёРµ Р±СѓРґРµС‚ РІС‹РїРѕР»РЅРµРЅРѕ С‚РѕР»СЊРєРѕ РІ С‚РѕРј СЃР»СѓС‡Р°Рµ, РµСЃР»Рё РїСЂРµСЂС‹РІР°РЅРёСЏ
СЂР°Р·СЂРµС€РµРЅС‹, Р° РІ СЂРµРіРёСЃС‚СЂРµ mie СѓСЃС‚Р°РЅРѕРІР»РµРЅ Р±РёС‚ MTIE.

*/
