#ifndef MIK32_HAL_SCR1_TIMER__H
#define MIK32_HAL_SCR1_TIMER__H
#include "mcu32_memory_map.h"
#include "power_manager.h"
#include "inttypes.h"

#include "mik32_hal_scr1_timer_types.h"
#include "scr1_timer.h"


void HAL_SCR1_Timer_Enable(SCR1_TIMER_HandleTypeDef *hscr1_timer);
void HAL_SCR1_Timer_Disable(SCR1_TIMER_HandleTypeDef *hscr1_timer);
void HAL_SCR1_Timer_SetClockSource(SCR1_TIMER_HandleTypeDef *hscr1_timer, uint8_t ClockSource);
void HAL_SCR1_Timer_SetDivider(SCR1_TIMER_HandleTypeDef *hscr1_timer, uint16_t Divider);
void HAL_SCR1_Timer_Init(SCR1_TIMER_HandleTypeDef *hscr1_timer);
void HAL_SCR1_Timer_Start(SCR1_TIMER_HandleTypeDef *hscr1_timer, uint32_t Milliseconds);
int HAL_SCR1_Timer_GetFlagCMP(SCR1_TIMER_HandleTypeDef *hscr1_timer);

/* Р’СЂРµРјСЏ Р·Р°РґРµСЂР¶РєРё РґРѕР»Р¶РµРЅРѕ Р±С‹С‚СЊ РЅРµ Р±РѕР»СЊС€Рµ 134217 РјСЃ */
//void HAL_DelayMs(SCR1_TIMER_HandleTypeDef *hscr1_timer, uint32_t Milliseconds);

#endif


/*

Р РµРіРёСЃС‚СЂ TIMER_CTRL
------------------------------------------------------------------------------------------------
РћР±РѕР·РЅР°С‡РµРЅРёРµ     |   Р‘РёС‚С‹    |   РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ    |   РћРїРёСЃР°РЅРёРµ                |   Р”РѕСЃС‚СѓРї
------------------------------------------------------------------------------------------------
ENABLE          |   0       |   X               |   Р’РєР»СЋС‡РµРЅРёРµ С‚Р°Р№РјРµСЂР°       |   RW
------------------------------------------------------------------------------------------------
CLKSRC          |   1       |   0x0             |   Р�СЃС‚РѕС‡РЅРёРє С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ   |   RW
                |           |                   |   0 - РўР°РєС‚РёСЂРѕРІР°РЅРёСЏ СЏРґСЂР°   |
                |           |                   |   1 - Р’РЅРµС€РЅРёР№ RTC         |
------------------------------------------------------------------------------------------------
Reserved        |   31:2    |                                               |   RZ
------------------------------------------------------------------------------------------------


Р РµРіРёСЃС‚СЂ TIMER_DIV
------------------------------------------------------------------------------------------------
РћР±РѕР·РЅР°С‡РµРЅРёРµ     |   Р‘РёС‚С‹    |   РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ    |   РћРїРёСЃР°РЅРёРµ                |   Р”РѕСЃС‚СѓРї
------------------------------------------------------------------------------------------------
DIV             |   9:0     |   X               |   Р”РµР»РёС‚РµР»СЊ                |   RW
                                                |   РЎС‡РµС‚ РёРґРµС‚ РєР°Р¶РґС‹Рµ DIV+1  |
                                                |   С‚Р°РєС‚Р° С‡Р°СЃС‚РѕС‚С‹           |
------------------------------------------------------------------------------------------------
Reserved        |   31:10   |   X                                           |   RZ
------------------------------------------------------------------------------------------------


РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ, MTIME Рё MTIMEH СЂР°РІРЅС‹ РЅСѓР»СЋ РїРѕСЃР»Рµ РїРµСЂРµР·Р°РіСЂСѓР·РєРё СЏРґСЂР° (РєРѕС‚РѕСЂР°СЏ С‚Р°РєР¶Рµ
РЅР°С‡РёРЅР°РµС‚ РїРѕРґСЃС‡РµС‚). Р”СЂСѓРіРёРј РІР°СЂРёР°РЅС‚РѕРј РЅР°С‡Р°Р»Р° СЃС‡РµС‚Р° РґР»СЏ MTIME/MTIMEH СЏРІР»СЏРµС‚СЃСЏ Р·Р°РїРёСЃСЊ РЅРµРєРѕС‚РѕСЂРѕРіРѕ Р·РЅР°С‡РµРЅРёСЏ РІ
MTIME/MTIMEH.

MTIME - РЎС‡РµС‚С‡РёРє С‚Р°Р№РјРµСЂР°. 64-Р±РёС‚РЅРµ С‡РёСЃР»Рѕ. MTIMEH - СЃС‚Р°СЂС€РµРµ СЃР»РѕРІРѕ, MTIME - РјР»Р°РґС€РµРµ СЃР»РѕРІРѕ.
MTIMECMP - Р РµРіРёСЃС‚СЂ СЃСЂР°РІРЅРµРЅРёСЏ. 64-Р±РёС‚РЅРѕРµ С‡РёСЃР»Рѕ. MTIMECMPH - СЃС‚Р°СЂС€РµРµ СЃР»РѕРІРѕ, MTIMECMP - РјР»Р°РґС€РµРµ СЃР»РѕРІРѕ.

РџСЂРµСЂС‹РІР°РЅРёРµ РјР°С€РёРЅРЅРѕРіРѕ С‚Р°Р№РјРµСЂР° СЃС‚Р°РЅРѕРІРёС‚СЃСЏ РѕР¶РёРґР°СЋС‰РёРј РІСЃСЏРєРёР№ СЂР°Р·, РєРѕРіРґР° mtime СЃРѕРґРµСЂР¶РёС‚ Р·РЅР°С‡РµРЅРёРµ, Р±РѕР»СЊС€РµРµ РёР»Рё СЂР°РІРЅРѕРµ mtimecmp,
РѕР±СЂР°Р±Р°С‚С‹РІР°СЏ Р·РЅР°С‡РµРЅРёСЏ РєР°Рє С†РµР»С‹Рµ С‡РёСЃР»Р° Р±РµР· Р·РЅР°РєР°. РџСЂРµСЂС‹РІР°РЅРёРµ СЃРѕС…СЂР°РЅСЏРµС‚СЃСЏ РґРѕ С‚РµС… РїРѕСЂ, РїРѕРєР° mtimecmp РЅРµ СЃС‚Р°РЅРµС‚ Р±РѕР»СЊС€Рµ
mtime (РѕР±С‹С‡РЅРѕ РІ СЂРµР·СѓР»СЊС‚Р°С‚Рµ Р·Р°РїРёСЃРё mtimecmp). РџСЂРµСЂС‹РІР°РЅРёРµ Р±СѓРґРµС‚ РїСЂРёРЅСЏС‚Рѕ С‚РѕР»СЊРєРѕ РІ С‚РѕРј СЃР»СѓС‡Р°Рµ, РµСЃР»Рё
РІРєР»СЋС‡РµРЅС‹ РїСЂРµСЂС‹РІР°РЅРёСЏ Рё Р±РёС‚ MTIE СѓСЃС‚Р°РЅРѕРІР»РµРЅ РІ СЂРµРіРёСЃС‚СЂРµ mie.

*/
