#ifndef UART_LIB_H_INCLUDED
#define UART_LIB_H_INCLUDED

/**
    Р‘РёР±Р»РёРѕС‚РµРєР° РґР»СЏ СЂР°Р±РѕС‚С‹ СЃ РєРѕРЅС‚СЂРѕР»Р»РµСЂРѕРј USART.
*/
#include "mik32_hal_pcc.h"
#include "mik32_hal_gpio.h"
#include "inttypes.h"
#include <stdbool.h>

#include "uart.h"
#include "mcu32_memory_map.h"

#define XPRINTF_NO 0
#define XPRINTF_YES 0xFF
#define XPRINTF_UART_0 1
#define XPRINTF_UART_1 2
#define XPRINTF_BOTH 3
#define XPRINTF_ALL 0xFF

void xfunc_output(int chr);

void HAL_UART_MspInit(UART_TypeDef *uart);

/** Р�РЅРёС†РёР°Р»РёР·РёСЂСѓРµС‚ РєРѕРЅС‚СЂРѕР»Р»РµСЂ USART

    Р¤СѓРЅРєС†РёСЏ Р·Р°РґР°РµС‚ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹ Рё РґРµР»РёС‚РµР»СЊ СЃРєРѕСЂРѕСЃС‚Рё РѕР±РјРµРЅР°.
    `РЎРєРѕСЂРѕСЃС‚СЊ РѕР±РјРµРЅР° = С‡Р°СЃС‚РѕС‚С‹ С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ РєРѕРЅС‚СЂРѕР»Р»РµСЂР° / divider`
    \warning Р”РµР»РёС‚РµР»СЊ РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ РЅРµ РјРµРЅРµРµ 16

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART
    \param divider РґРµР»РёС‚РµР»СЊ С‡Р°СЃС‚РѕС‚С‹ С‚Р°РєС‚РёСЂРѕРІР°РЅРёСЏ РєРѕРЅС‚СЂРѕР»Р»РµСЂР°
    \param control1 Р·РЅР°С‡РµРЅРёРµ СЂРµРіРёСЃС‚СЂР° СѓРїСЂР°РІР»РµРЅРёСЏ 1
    \param control2 Р·РЅР°С‡РµРЅРёРµ СЂРµРіРёСЃС‚СЂР° СѓРїСЂР°РІР»РµРЅРёСЏ 2
    \param control3 Р·РЅР°С‡РµРЅРёРµ СЂРµРіРёСЃС‚СЂР° СѓРїСЂР°РІР»РµРЅРёСЏ 3

    \return Р•СЃР»Рё РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ РІС‹РїРѕР»РЅРµРЅР° СѓСЃРїРµС€РЅРѕ,
            С‚Рѕ РІРѕР·РІСЂР°С‰Р°РµС‚СЃСЏ true

*/
bool UART_Init(UART_TypeDef *uart, uint32_t divider, uint32_t control1, uint32_t control2, uint32_t control3, uint8_t xprintf_allow);

/** РћРїСЂРµРґРµР»СЏРµС‚, Р°РєС‚РёРІРµРЅ Р»Рё РїРµСЂРµРґР°С‚С‡РёРє РјРѕРґСѓР»СЏ

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART

    \return Р•СЃР»Рё РїРµСЂРµРґР°С‡Р° Р·Р°РІРµСЂС€РµРЅР°, РІРѕР·РІСЂР°С‰Р°РµС‚СЃСЏ true
 */
bool UART_IsTransmissionFinished(UART_TypeDef *uart);

/** РћР¶РёРґР°РµС‚, РїРѕРєР° РјРѕРґСѓР»СЊ РїРµСЂРµРґР°СЃС‚ РІСЃРµ Р·Р°РїРёСЃР°РЅРЅС‹Рµ РІ Р±СѓС„РµСЂ Р±Р°Р№С‚С‹

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART
 */
void UART_WaitTransmission(UART_TypeDef *uart);

/** РћР¶РёРґР°РµС‚, РїРѕРєР° РјРѕРґСѓР»СЊ РїСЂРёРјРµС‚ РґР°РЅРЅС‹Рµ

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART
 */
void UART_WaitReceiving(UART_TypeDef *uart);

/** РћРїСЂРµРґРµР»СЏРµС‚, Р±С‹Р» Р»Рё Р±Р°Р№С‚ Р·Р°Р±СЂР°РЅ РїРµСЂРµРґР°С‚С‡РёРєРѕРј РёР· РїРµСЂРµРґР°СЋС‰РµРіРѕ Р±СѓС„РµСЂР°

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART

    \return Р•СЃР»Рё РїРµСЂРµРґР°СЋС‰РёР№ Р±СѓС„РµСЂ РїРѕР»РѕРЅ, С‚Рѕ РІРѕР·РІСЂР°С‰Р°РµС‚СЃСЏ true
 */
bool UART_IsTxBufferFreed(UART_TypeDef *uart);

/** РћРїСЂРµРґРµР»СЏРµС‚, РїРѕР»РѕРЅ Р»Рё РїСЂРёРЅРёРјР°СЋС‰РёР№ Р±СѓС„РµСЂ

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART

    \return Р•СЃР»Рё РІ РїСЂРёРЅРёРјР°СЋС‰РµРј Р±СѓС„РµСЂРµ РµСЃС‚СЊ РґР°РЅРЅС‹Рµ, С‚Рѕ РІРѕР·РІСЂР°С‰Р°РµС‚СЃСЏ true
 */
bool UART_IsRxFifoFull(UART_TypeDef *uart);

/** РћРїСЂРµРґРµР»СЏРµС‚, РїСѓСЃС‚ Р»Рё РїСЂРёРЅРёРјР°СЋС‰РёР№ Р±СѓС„РµСЂ

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART

    \return Р•СЃР»Рё РІ РїСЂРёРЅРёРјР°СЋС‰РµРј Р±СѓС„РµСЂРµ РЅРµС‚ РґР°РЅРЅС‹С…, С‚Рѕ РІРѕР·РІСЂР°С‰Р°РµС‚СЃСЏ true
 */
bool UART_IsRxFifoEmpty(UART_TypeDef *uart);

/** Р—Р°РїРёСЃС‹РІР°РµС‚ Р±Р°Р№С‚ РІ РїРµСЂРµРґР°СЋС‰РёР№ Р±СѓС„РµСЂ USART
    Р¤СѓРЅРєС†РёСЏ Р·Р°РїРёСЃС‹РІР°РµС‚ Р±Р°Р№С‚ РІ РїРµСЂРµРґР°СЋС‰РёР№ Р±СѓС„РµСЂ.
    Р•СЃР»Рё РїРµСЂРµРґ Р·Р°РїРёСЃСЊСЋ Р±СѓС„РµСЂ РїРѕР»РѕРЅ,
    С‚Рѕ С„СѓРЅРєС†РёСЏ РѕР¶РёРґР°РµС‚, РїРѕРєР° РІ Р±СѓС„РµСЂРµ РЅРµ РїРѕСЏРІРёС‚СЃСЏ РјРµСЃС‚Рѕ.

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART
    \param byte РѕС‚РїСЂР°РІР»СЏРµРјС‹Рµ РґР°РЅРЅС‹Рµ
*/
void UART_WriteByte(UART_TypeDef *uart, uint16_t byte);

/** Р§РёС‚Р°РµС‚ Р±Р°Р№С‚ РёР· РїСЂРёРЅРёРјР°СЋС‰РµРіРѕ Р±СѓС„РµСЂ USART
    Р¤СѓРЅРєС†РёСЏ С‡РёС‚Р°РµС‚ Р±Р°Р№С‚ РёР· РїСЂРёРЅРёРјР°СЋС‰РµРіРѕ Р±СѓС„РµСЂР°.
    Р•СЃР»Рё РїРµСЂРµРґ С‡С‚РµРЅРёРµРј Р±СѓС„РµСЂ РїСѓСЃС‚,
    С‚Рѕ С„СѓРЅРєС†РёСЏ РѕР¶РёРґР°РµС‚ РїСЂРёРµРјР° РЅРѕРІРѕРіРѕ Р±Р°Р№С‚Р°.

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART

    \return РїСЂРёРЅСЏС‚С‹Рµ РґР°РЅРЅС‹Рµ
*/
uint16_t UART_ReadByte(UART_TypeDef *uart);

/** Р—Р°РїРёСЃС‹РІР°РµС‚ РјР°СЃСЃРёРІ Р±Р°Р№С‚ РІ РїРµСЂРµРґР°СЋС‰РёР№ Р±СѓС„РµСЂ USART

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART
    \param byte_array
    \param count
 */
void UART_Write(UART_TypeDef *uart, uint16_t *byte_array, uint32_t count);

/** Р§РёС‚Р°РµС‚ РјР°СЃСЃРёРІ Р±Р°Р№С‚ РёР· РїСЂРёРЅРёРјР°СЋС‰РµРіРѕ Р±СѓС„РµСЂ USART

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART
 */
void UART_Read(UART_TypeDef *uart, uint8_t *byte_array, uint32_t count);

/** РћС‡РёС‰Р°РµС‚ РїСЂРёРЅРёРјР°СЋС‰РёР№ Р±СѓС„РµСЂ

    \param uart СѓРєР°Р·Р°С‚РµР»СЊ РґР»СЏ РґРѕСЃС‚СѓРїР° Рє UART
 */
void UART_ClearRxFifo(UART_TypeDef *uart);

/** Р’С‹Р±РёСЂР°РµС‚ РїРѕСЂС‚С‹ UART РґР»СЏ РІС‹РІРѕРґР° С„СѓРЅРєС†РёРµР№ "xprintf".
    Р•СЃР»Рё РїРѕСЂС‚ РЅРµР°РєС‚РёРІРµРЅ, С‚Рѕ РЅРёРєР°РєРёС… РёР·РјРµРЅРµРЅРёР№ РЅРµ
    РїСЂРѕРёР·РІРѕРґРёС‚СЃСЏ.

    \param xprintf_uarts_value Р±РёС‚ 0 = UART_0, Р±РёС‚ 1 = UART_1
*/
void xprintf_uarts_allow(uint8_t xprintf_uarts_value);

#endif // UART_LIB_H_INCLUDED
